{"format": "graph-model", "generatedBy": "1.15.0", "convertedBy": "TensorFlow.js Converter v1.4.0", "userDefinedMetadata": {"signature": {"inputs": {"input:0": {"name": "input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "320"}, {"size": "320"}, {"size": "3"}]}}}, "outputs": {"loss_layer/strided_slice:0": {"name": "loss_layer/strided_slice:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "5"}, {"size": "5"}, {"size": "2"}]}}, "loss_layer/stack:0": {"name": "loss_layer/stack:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "5"}, {"size": "5"}, {"size": "2"}, {"size": "4"}]}}}}}, "modelTopology": {"node": [{"name": "input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "320"}, {"size": "320"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "vgg_16/conv1/conv1_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "loss_layer/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "vgg_16/conv1/conv1_1/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "vgg_16/conv2/conv2_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "vgg_16/conv2/conv2_1/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "loss_layer/strided_slice_4/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "vgg_16/conv2/conv2_2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "loss_layer/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "5"}, {"size": "5"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "loss_layer/strided_slice_4/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "vgg_16/conv2/conv2_2/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "loss_layer/strided_slice_4/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "vgg_16/conv3/conv3_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "vgg_16/conv3/conv3_1/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "vgg_16/conv4/conv4_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "loss_layer/transpose", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "5"}, {"size": "5"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "vgg_16/conv4/conv4_1/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "loss_layer/strided_slice_5/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "vgg_16/conv5/conv5_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "vgg_16/conv5/conv5_1/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "vgg_16/conv6/conv6_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/loss_layer/truediv_1_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "vgg_16/conv6/conv6_1/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "vgg_16/fc6/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "loss_layer/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "vgg_16/fc6/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "loss_layer/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "vgg_16/fc8/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "loss_layer/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "vgg_16/fc8/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "loss_layer/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "loss_layer/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "loss_layer/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "vgg_16/conv1/conv1_1/BiasAdd", "op": "_FusedConv2D", "input": ["input", "vgg_16/conv1/conv1_1/weights", "vgg_16/conv1/conv1_1/biases"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "vgg_16/pool1/MaxPool", "op": "MaxPool", "input": ["vgg_16/conv1/conv1_1/BiasAdd"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "vgg_16/conv1/conv1_1/Relu", "op": "Relu", "input": ["vgg_16/pool1/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "vgg_16/conv2/conv2_1/Relu", "op": "_FusedConv2D", "input": ["vgg_16/conv1/conv1_1/Relu", "vgg_16/conv2/conv2_1/weights", "vgg_16/conv2/conv2_1/biases"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "vgg_16/conv2/conv2_2/BiasAdd", "op": "_FusedConv2D", "input": ["vgg_16/conv2/conv2_1/Relu", "vgg_16/conv2/conv2_2/weights", "vgg_16/conv2/conv2_2/biases"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "vgg_16/pool2/MaxPool", "op": "MaxPool", "input": ["vgg_16/conv2/conv2_2/BiasAdd"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "vgg_16/conv2/conv2_2/Relu", "op": "Relu", "input": ["vgg_16/pool2/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "vgg_16/conv3/conv3_1/BiasAdd", "op": "_FusedConv2D", "input": ["vgg_16/conv2/conv2_2/Relu", "vgg_16/conv3/conv3_1/weights", "vgg_16/conv3/conv3_1/biases"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "vgg_16/pool3/MaxPool", "op": "MaxPool", "input": ["vgg_16/conv3/conv3_1/BiasAdd"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "vgg_16/conv3/conv3_1/Relu", "op": "Relu", "input": ["vgg_16/pool3/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "vgg_16/conv4/conv4_1/BiasAdd", "op": "_FusedConv2D", "input": ["vgg_16/conv3/conv3_1/Relu", "vgg_16/conv4/conv4_1/weights", "vgg_16/conv4/conv4_1/biases"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "vgg_16/pool4/MaxPool", "op": "MaxPool", "input": ["vgg_16/conv4/conv4_1/BiasAdd"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "vgg_16/conv4/conv4_1/Relu", "op": "Relu", "input": ["vgg_16/pool4/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "vgg_16/conv5/conv5_1/BiasAdd", "op": "_FusedConv2D", "input": ["vgg_16/conv4/conv4_1/Relu", "vgg_16/conv5/conv5_1/weights", "vgg_16/conv5/conv5_1/biases"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "vgg_16/pool5/MaxPool", "op": "MaxPool", "input": ["vgg_16/conv5/conv5_1/BiasAdd"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "vgg_16/conv5/conv5_1/Relu", "op": "Relu", "input": ["vgg_16/pool5/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "vgg_16/conv6/conv6_1/BiasAdd", "op": "_FusedConv2D", "input": ["vgg_16/conv5/conv5_1/Relu", "vgg_16/conv6/conv6_1/weights", "vgg_16/conv6/conv6_1/biases"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "vgg_16/pool6/MaxPool", "op": "MaxPool", "input": ["vgg_16/conv6/conv6_1/BiasAdd"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "vgg_16/conv6/conv6_1/Relu", "op": "Relu", "input": ["vgg_16/pool6/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "vgg_16/fc6/Relu", "op": "_FusedConv2D", "input": ["vgg_16/conv6/conv6_1/Relu", "vgg_16/fc6/weights", "vgg_16/fc6/biases"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "vgg_16/fc8/BiasAdd", "op": "_FusedConv2D", "input": ["vgg_16/fc6/Relu", "vgg_16/fc8/weights", "vgg_16/fc8/biases"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "loss_layer/strided_slice", "op": "StridedSlice", "input": ["vgg_16/fc8/BiasAdd", "loss_layer/strided_slice/stack", "loss_layer/strided_slice/stack_1", "loss_layer/strided_slice/stack_2"], "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "15"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "7"}}}, {"name": "loss_layer/strided_slice_1", "op": "StridedSlice", "input": ["vgg_16/fc8/BiasAdd", "loss_layer/strided_slice/stack_1", "loss_layer/strided_slice_1/stack_1", "loss_layer/strided_slice/stack_2"], "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "7"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "7"}}}, {"name": "loss_layer/Reshape", "op": "Reshape", "input": ["loss_layer/strided_slice_1", "loss_layer/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "loss_layer/strided_slice_3", "op": "StridedSlice", "input": ["loss_layer/Reshape", "loss_layer/strided_slice_2/stack_1", "loss_layer/strided_slice_4/stack", "loss_layer/strided_slice_4/stack_2"], "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "16"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "15"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "15"}}}, {"name": "loss_layer/strided_slice_4", "op": "StridedSlice", "input": ["loss_layer/Reshape", "loss_layer/strided_slice_4/stack", "loss_layer/strided_slice_4/stack_1", "loss_layer/strided_slice_4/stack_2"], "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "16"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "15"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "15"}}}, {"name": "loss_layer/strided_slice_5", "op": "StridedSlice", "input": ["loss_layer/Reshape", "loss_layer/strided_slice_4/stack_1", "loss_layer/strided_slice_5/stack_1", "loss_layer/strided_slice_4/stack_2"], "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "16"}, "begin_mask": {"i": "15"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "15"}}}, {"name": "loss_layer/strided_slice_2", "op": "StridedSlice", "input": ["loss_layer/Reshape", "loss_layer/strided_slice_2/stack", "loss_layer/strided_slice_2/stack_1", "loss_layer/strided_slice_4/stack_2"], "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "16"}, "begin_mask": {"i": "15"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "15"}}}, {"name": "loss_layer/add_1", "op": "AddV2", "input": ["loss_layer/strided_slice_3", "loss_layer/transpose"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "loss_layer/Square", "op": "Square", "input": ["loss_layer/strided_slice_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "loss_layer/Square_1", "op": "Square", "input": ["loss_layer/strided_slice_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "loss_layer/add", "op": "AddV2", "input": ["loss_layer/Const", "loss_layer/strided_slice_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "loss_layer/truediv_1", "op": "Mul", "input": ["ConstantFolding/loss_layer/truediv_1_recip", "loss_layer/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "loss_layer/truediv", "op": "Mul", "input": ["ConstantFolding/loss_layer/truediv_1_recip", "loss_layer/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "loss_layer/stack", "op": "Pack", "input": ["loss_layer/truediv", "loss_layer/truediv_1", "loss_layer/Square", "loss_layer/Square_1"], "attr": {"T": {"type": "DT_FLOAT"}, "axis": {"i": "-1"}, "N": {"i": "4"}}}], "versions": {"producer": 134}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "vgg_16/conv1/conv1_1/weights", "shape": [3, 3, 3, 16], "dtype": "float32"}, {"name": "loss_layer/strided_slice_2/stack_1", "shape": [5], "dtype": "int32"}, {"name": "vgg_16/conv1/conv1_1/biases", "shape": [16], "dtype": "float32"}, {"name": "vgg_16/conv2/conv2_1/weights", "shape": [3, 3, 16, 32], "dtype": "float32"}, {"name": "vgg_16/conv2/conv2_1/biases", "shape": [32], "dtype": "float32"}, {"name": "loss_layer/strided_slice_4/stack", "shape": [5], "dtype": "int32"}, {"name": "vgg_16/conv2/conv2_2/weights", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "loss_layer/Const", "shape": [1, 5, 5, 2], "dtype": "float32"}, {"name": "loss_layer/strided_slice_4/stack_1", "shape": [5], "dtype": "int32"}, {"name": "vgg_16/conv2/conv2_2/biases", "shape": [32], "dtype": "float32"}, {"name": "loss_layer/strided_slice_4/stack_2", "shape": [5], "dtype": "int32"}, {"name": "vgg_16/conv3/conv3_1/weights", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "vgg_16/conv3/conv3_1/biases", "shape": [64], "dtype": "float32"}, {"name": "vgg_16/conv4/conv4_1/weights", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "loss_layer/transpose", "shape": [1, 5, 5, 2], "dtype": "float32"}, {"name": "vgg_16/conv4/conv4_1/biases", "shape": [128], "dtype": "float32"}, {"name": "loss_layer/strided_slice_5/stack_1", "shape": [5], "dtype": "int32"}, {"name": "vgg_16/conv5/conv5_1/weights", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "vgg_16/conv5/conv5_1/biases", "shape": [128], "dtype": "float32"}, {"name": "vgg_16/conv6/conv6_1/weights", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "ConstantFolding/loss_layer/truediv_1_recip", "shape": [], "dtype": "float32"}, {"name": "vgg_16/conv6/conv6_1/biases", "shape": [128], "dtype": "float32"}, {"name": "vgg_16/fc6/weights", "shape": [1, 1, 128, 256], "dtype": "float32"}, {"name": "loss_layer/strided_slice/stack", "shape": [4], "dtype": "int32"}, {"name": "vgg_16/fc6/biases", "shape": [256], "dtype": "float32"}, {"name": "loss_layer/strided_slice/stack_1", "shape": [4], "dtype": "int32"}, {"name": "vgg_16/fc8/weights", "shape": [1, 1, 256, 10], "dtype": "float32"}, {"name": "loss_layer/strided_slice/stack_2", "shape": [4], "dtype": "int32"}, {"name": "vgg_16/fc8/biases", "shape": [10], "dtype": "float32"}, {"name": "loss_layer/strided_slice_1/stack_1", "shape": [4], "dtype": "int32"}, {"name": "loss_layer/Reshape/shape", "shape": [5], "dtype": "int32"}, {"name": "loss_layer/strided_slice_2/stack", "shape": [5], "dtype": "int32"}]}]}